mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xc/common/s6e1a1xc.h
#define FM_MTB_DWT_CMP_MASK_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_FCT_AVAILABLE                1
#define FM_MTB_DWT_FCT_AVAILABLE                  1
#define FM0P_MTB_DWT_PID0_AVAILABLE               1
#define FM_MTB_DWT_PID0_AVAILABLE                 1
#define FM0P_MTB_DWT_PID1_AVAILABLE               1
#define FM_MTB_DWT_PID1_AVAILABLE                 1
#define FM0P_MTB_DWT_PID2_AVAILABLE               1
#define FM_MTB_DWT_PID2_AVAILABLE                 1
#define FM0P_MTB_DWT_PID3_AVAILABLE               1
#define FM_MTB_DWT_PID3_AVAILABLE                 1
#define FM0P_MTB_DWT_PID4_AVAILABLE               1
#define FM_MTB_DWT_PID4_AVAILABLE                 1
#define FM0P_MTB_DWT_PID5_AVAILABLE               1
#define FM_MTB_DWT_PID5_AVAILABLE                 1
#define FM0P_MTB_DWT_PID6_AVAILABLE               1
#define FM_MTB_DWT_PID6_AVAILABLE                 1
#define FM0P_MTB_DWT_PID7_AVAILABLE               1
#define FM_MTB_DWT_PID7_AVAILABLE                 1
/*******************************************************************************
* QPRC0
*******************************************************************************/
#define FM0P_QPRC_QCR_AVAILABLE                   1
#define FM_QPRC_QCR_AVAILABLE                     1
#define FM0P_QPRC_QECR_AVAILABLE                  1
#define FM_QPRC_QECR_AVAILABLE                    1
#define FM0P_QPRC_QICRH_AVAILABLE                 1
#define FM_QPRC_QICRH_AVAILABLE                   1
#define FM0P_QPRC_QICRL_AVAILABLE                 1
#define FM_QPRC_QICRL_AVAILABLE                   1
#define FM0P_QPRC_QMPR_AVAILABLE                  1
#define FM_QPRC_QMPR_AVAILABLE                    1
#define FM0P_QPRC_QPCCR_AVAILABLE                 1
#define FM_QPRC_QPCCR_AVAILABLE                   1
#define FM0P_QPRC_QPCR_AVAILABLE                  1
#define FM_QPRC_QPCR_AVAILABLE                    1
#define FM0P_QPRC_QPRCR_AVAILABLE                 1
#define FM_QPRC_QPRCR_AVAILABLE                   1
#define FM0P_QPRC_QPRCRR_AVAILABLE                1
#define FM_QPRC_QPRCRR_AVAILABLE                  1
#define FM0P_QPRC_QRCR_AVAILABLE                  1
#define FM_QPRC_QRCR_AVAILABLE                    1
/*******************************************************************************
* QPRC0_NF
*******************************************************************************/
#define FM0P_QPRC_NF_NFCTLA_AVAILABLE             1
#define FM_QPRC_NF_NFCTLA_AVAILABLE               1
#define FM0P_QPRC_NF_NFCTLB_AVAILABLE             1
#define FM_QPRC_NF_NFCTLB_AVAILABLE               1
#define FM0P_QPRC_NF_NFCTLZ_AVAILABLE             1
#define FM_QPRC_NF_NFCTLZ_AVAILABLE               1
/*******************************************************************************
* RTC
*******************************************************************************/
#define FM0P_RTC_ALDR_AVAILABLE                   1
#define FM_RTC_ALDR_AVAILABLE                     1
#define FM0P_RTC_ALHR_AVAILABLE                   1
#define FM_RTC_ALHR_AVAILABLE                     1
#define FM0P_RTC_ALMIR_AVAILABLE                  1
#define FM_RTC_ALMIR_AVAILABLE                    1
#define FM0P_RTC_ALMOR_AVAILABLE                  1
#define FM_RTC_ALMOR_AVAILABLE                    1
#define FM0P_RTC_ALYR_AVAILABLE                   1
#define FM_RTC_ALYR_AVAILABLE                     1
#define FM0P_RTC_WTBR_AVAILABLE                   1
#define FM_RTC_WTBR_AVAILABLE                     1
#define FM0P_RTC_WTCAL_AVAILABLE                  1
#define FM_RTC_WTCAL_AVAILABLE                    1
#define FM0P_RTC_WTCALEN_AVAILABLE                1
#define FM_RTC_WTCALEN_AVAILABLE                  1
#define FM0P_RTC_WTCALPRD_AVAILABLE               1
#define FM_RTC_WTCALPRD_AVAILABLE                 1
#define FM0P_RTC_WTCLKM_AVAILABLE                 1
#define FM_RTC_WTCLKM_AVAILABLE                   1
#define FM0P_RTC_WTCLKS_AVAILABLE                 1
#define FM_RTC_WTCLKS_AVAILABLE                   1
#define FM0P_RTC_WTCOSEL_AVAILABLE                1
#define FM_RTC_WTCOSEL_AVAILABLE                  1
#define FM0P_RTC_WTCR1_AVAILABLE                  1
#define FM_RTC_WTCR1_AVAILABLE                    1
#define FM0P_RTC_WTCR2_AVAILABLE                  1
#define FM_RTC_WTCR2_AVAILABLE                    1
#define FM0P_RTC_WTDIV_AVAILABLE                  1
#define FM_RTC_WTDIV_AVAILABLE                    1
#define FM0P_RTC_WTDIVEN_AVAILABLE                1
#define FM_RTC_WTDIVEN_AVAILABLE                  1
#define FM0P_RTC_WTDR_AVAILABLE                   1
#define FM_RTC_WTDR_AVAILABLE                     1
#define FM0P_RTC_WTDW_AVAILABLE                   1
#define FM_RTC_WTDW_AVAILABLE                     1
#define FM0P_RTC_WTHR_AVAILABLE                   1
#define FM_RTC_WTHR_AVAILABLE                     1
#define FM0P_RTC_WTMIR_AVAILABLE                  1
#define FM_RTC_WTMIR_AVAILABLE                    1
#define FM0P_RTC_WTMOR_AVAILABLE                  1
#define FM_RTC_WTMOR_AVAILABLE                    1
#define FM0P_RTC_WTSR_AVAILABLE                   1
#define FM_RTC_WTSR_AVAILABLE                     1
#define FM0P_RTC_WTTR_AVAILABLE                   1
#define FM_RTC_WTTR_AVAILABLE                     1
#define FM0P_RTC_WTYR_AVAILABLE                   1
#define FM_RTC_WTYR_AVAILABLE                     1
/*******************************************************************************
* SBSSR
*******************************************************************************/
#define FM0P_SBSSR_BTSSSR_AVAILABLE               1
#define FM_SBSSR_BTSSSR_AVAILABLE                 1
/*******************************************************************************
* SWWDT
*******************************************************************************/
#define FM0P_SWWDT_WDOGCONTROL_AVAILABLE          1
#define FM_SWWDT_WDOGCONTROL_AVAILABLE            1
#define FM0P_SWWDT_WDOGINTCLR_AVAILABLE           1
#define FM_SWWDT_WDOGINTCLR_AVAILABLE             1
#define FM0P_SWWDT_WDOGLOAD_AVAILABLE             1
#define FM_SWWDT_WDOGLOAD_AVAILABLE               1
#define FM0P_SWWDT_WDOGLOCK_AVAILABLE             1
#define FM_SWWDT_WDOGLOCK_AVAILABLE               1
#define FM0P_SWWDT_WDOGRIS_AVAILABLE              1
#define FM_SWWDT_WDOGRIS_AVAILABLE                1
#define FM0P_SWWDT_WDOGSPMC_AVAILABLE             1
#define FM_SWWDT_WDOGSPMC_AVAILABLE               1
#define FM0P_SWWDT_WDOGVALUE_AVAILABLE            1
#define FM_SWWDT_WDOGVALUE_AVAILABLE              1
/*******************************************************************************
* UNIQUE_ID
*******************************************************************************/
#define FM0P_UNIQUE_ID_UIDR0_AVAILABLE            1
#define FM_UNIQUE_ID_UIDR0_AVAILABLE              1
#define FM0P_UNIQUE_ID_UIDR1_AVAILABLE            1
#define FM_UNIQUE_ID_UIDR1_AVAILABLE              1
/*******************************************************************************
* WC
*******************************************************************************/
#define FM0P_WC_CLK_EN_AVAILABLE                  1
#define FM_WC_CLK_EN_AVAILABLE                    1
#define FM0P_WC_CLK_SEL_AVAILABLE                 1
#define FM_WC_CLK_SEL_AVAILABLE                   1
#define FM0P_WC_WCCR_AVAILABLE                    1
#define FM_WC_WCCR_AVAILABLE                      1
#define FM0P_WC_WCRD_AVAILABLE                    1
#define FM_WC_WCRD_AVAILABLE                      1
#define FM0P_WC_WCRL_AVAILABLE                    1
#define FM_WC_WCRL_AVAILABLE                      1

